Repository: codacy-open-source-projects-scans/setroubleshoot-plugins
Catalog: po/*.po
Languages: fi

source: SELinux denied access requested by $SOURCE. It is not expected that this access is required by $SOURCE and this access may signal an intrusion attempt. It is also possible that the specific version or configuration of the application is causing it to require additional access.
fi: SELinux eväsi $SOURCE:n pyytämän pääsyn. Ei ole odotettavissa, että $SOURCE tarvitsee tätä käyttöoikeutta ja tämän käyttöoikeuden pyytäminen voi merkitä tunkeutumisyritystä. On myös mahdollista, että erityinen sovelluksen versio tai kokoonpano aiheuttaa sen, että se pyytää lisää pääsyoikeuksia.

source: You can generate a local policy module to allow this access - see <a href="http://docs.fedoraproject.org/selinux-faq-fc5/#id2961385">FAQ</a> Please file a bug report.
fi: Voit luoda paikallisen käytäntömoduulin tämän pääsyn sallimiseksi katso <a href="http://docs.fedoraproject.org/selinux-faq-fc5/#id2961385">FAQ</a> Lähetä virheraportti.

source: If you believe that $SOURCE_BASE_PATH should be allowed $ACCESS access on processes labeled $TARGET_TYPE by default.
fi: Jos uskot, että $SOURCE_BASE_PATH:lle pitäisi antaa $ACCESS -käyttöoikeus prosesseille, joiden nimiö on $TARGET_TYPE oletuksena.

source: If you believe that $SOURCE_BASE_PATH should have the $ACCESS capability by default.
fi: Jos uskot, että $SOURCE_BASE_PATH:llä pitäisi olla $ACCESS -käyttöoikeus oletuksena.

source: If you believe that $SOURCE_BASE_PATH should be allowed $ACCESS access on $TARGET_CLASS labeled $TARGET_TYPE by default.
fi: Jos uskot, että $SOURCE_BASE_PATH:lle pitäisi antaa $ACCESS -käyttöoikeus kohteelle $TARGET_CLASS, joiden nimiö on $TARGET_TYPE, oletuksena.

source: If you believe that $SOURCE_BASE_PATH should be allowed $ACCESS access on the $TARGET_BASE_PATH $TARGET_CLASS by default.
fi: Jos uskot, että $SOURCE_BASE_PATH:lle pitäisi antaa $ACCESS -käyttöoikeus kohteelle $TARGET_BASE_PATH $TARGET_CLASS oletuksena.

source: You should report this as a bug. You can generate a local policy module to allow this access.
fi: Sinun tulisi ilmoittaa tästä virheenä. Voit luoda paikallisen käytäntömoduulin salliaksesi tämän pääsyn.

source: Allow this access for now by executing: # ausearch -c '$SOURCE' --raw | audit2allow -M my-$MODULE_NAME # semodule -X 300 -i my-$MODULE_NAME.pp
fi: Salli tämä käyttö toistaiseksi suorittamalla: # ausearch -c '$SOURCE' --raw | audit2allow -M my-$MODULE_NAME # semodule -X 300 -i my-$MODULE_NAME.pp

source: SELinux is preventing $SOURCE_PATH from connecting to port $PORT_NUMBER.
fi: SELinux estää $SOURCE_PATH yhdistämästä porttiin $PORT_NUMBER

source: SELinux has denied $SOURCE from connecting to a network port $PORT_NUMBER which does not have an SELinux type associated with it. If $SOURCE should be allowed to connect on $PORT_NUMBER, use the <i>semanage</i> command to assign $PORT_NUMBER to a port type that $SOURCE_TYPE can connect to (%s). If $SOURCE is not supposed to connect to $PORT_NUMBER, this could signal an intrusion attempt.
fi: SELinux on estänyt $SOURCE:n muodostamasta yhteyttä verkkoporttiin $PORT_NUMBER, johon ei ole liitetty SELinux-tyyppiä. Jos $SOURCE:n pitäisi sallia muodostaa yhteys osoitteeseen $PORT_NUMBER, määritä $PORT_NUMBER komennolla <i>semanage</i> $PORT_NUMBER porttityyppiin, johon $SOURCE_TYPE voi muodostaa yhteyden (%s). Jos $SOURCE:n ei ole tarkoitus muodostaa yhteyttä kohteeseen $PORT_NUMBER, se voi merkitä tunkeutumisyritystä.

source: If you want to allow $SOURCE to connect to $PORT_NUMBER, you can execute # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER where PORT_TYPE is one of the following: %s.
fi: Jos haluat antaa $SOURCE:n muodostaa yhteyden kohteeseen $PORT_NUMBER, voit suorittaa: # semanage port -a -t PORTTI_TYYPPI -p %s $PORT_NUMBER missä PORTTI_TYYPPI on yksi seuraavista: %s.

source: If you want to allow $SOURCE_PATH to connect to network port $PORT_NUMBER
fi: Jos haluat sallia $SOURCE_PATH:n sidonnan verkkoporttiin $PORT_NUMBER

source: SELinux denied access requested by $SOURCE. It is not expected that this access is required by $SOURCE and this access may signal an intrusion attempt. It is also possible that the specific version or configuration of the application is causing it to require additional access. spice-xpi run applications within mozilla-plugins that require access to the desktop, that the mozilla_plugin lockdown will not allow, so either you need to turn off the mozilla_plugin lockdown or not use these packages.
fi: SELinux eväsi $SOURCE:n pyytämän pääsyn. Ei odoteta, että $SOURCE tarvitsee tätä käyttöoikeutta, ja tämä pääsy voi merkitä tunkeutumisyritystä. On myös mahdollista, että sovelluksen tietyn version tai kokoonpanon vuoksi se tarvitsee lisäoikeuksia. spice-xpi ajaa sovelluksia mozilla-laajennuksissa, jotka edellyttävät pääsyä työpöydälle, joita mozilla_plugin-lukitus ei salli, joten sinun on joko poistettava käytöstä mozilla_plugin-lukitus tai olla käyttämättä näitä paketteja.

source: Either remove the mozplugger or spice-xpi package by executing 'yum remove mozplugger spice-xpi', or turn off enforcement of SELinux over the Chrome plugins. setsebool -P unconfined_chrome_sandbox_transition 0
fi: Joko poista mozplugger- tai spice-xpi-paketti suorittamalla 'yum remove mozplugger spice-xpi' tai poista SELinuxin pakottaminen käytöstä Chrome-laajennusten kautta. setsebool -P unconfined_chrome_sandbox_transition 0

source: If you want to use the %s package
fi: Jos haluat käyttää %s-pakettia

source: you must turn off SELinux controls on the Chrome plugins.
fi: sinun on poistettava käytöstä SELinux-hallintalaitteet Chrome-laajennuksista.

source: Disable SELinux controls on Chrome plugins
fi: Poista käytöstä SELinux-hallintalaitteet Chrome-laajennuksista

source: SELinux is preventing cvs ($SOURCE_PATH) "$ACCESS" access to $TARGET_PATH
fi: SELinux estää cvs ($SOURCE_PATH) "$ACCESS" pääsyn kohteeseen $TARGET_PATH

source: SELinux denied cvs access to $TARGET_PATH. If this is a CVS repository it needs to have a file context label of cvs_data_t. If you did not intend to use $TARGET_PATH as a CVS repository it could indicate either a bug or it could signal an intrusion attempt.
fi: SELinux eväsi cvs:n pääsyn kohteeseen $TARGET_PATH. Jos tämä on CVS-arkisto, sillä on oltava tiedoston kontekstinimiö cvs_data_t. Jos et aikonut käyttää $TARGET_PATH:ta CVS-arkistona, tämä voi osoittaa joko virheen tai se voi merkitä tunkeutumisyritystä.

source: You can alter the file context by executing chcon -R -t cvs_data_t '$TARGET_PATH' You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t cvs_data_t '$FIX_TARGET_PATH'"
fi: Voit muuttaa tiedoston kontekstia suorittamalla chcon -R -t cvs_data_t '$TARGET_PATH' Sinun on myös muutettava järjestelmän oletustiedostokontekstit, jotta ne säilyvät myös täydessä uudelleenimiöinnissä. "semanage fcontext -a -t cvs_data_t '$FIX_TARGET_PATH'"

source: If $TARGET_BASE_PATH should be shared via the cvs daemon
fi: Jos $TARGET_BASE_PATH pitäisi jakaa cvs-daemonin kautta

source: You need to change the label on $TARGET_BASE_PATH'
fi: Sinun on vaihdettava nimiö kohteelle $TARGET_BASE_PATH '

source: Change label
fi: Vaihda nimiö

source: SELinux is preventing $SOURCE_PATH the "$ACCESS" capability.
fi: SELinux estää $SOURCE_PATH:ltäa "$ACCESS" -kyvyn.

source: dac_override and dac_read_search capabilities usually indicates that the root process does not have access to a file based on the permission flags. This usually mean you have some file with the wrong ownership/permissions on it.
fi: dac_override ja dac_read_search -ominaisuudet osoittavat yleensä, että juuriprosessilla ei ole pääsyä tiedostoon käyttöoikeusmerkkien perusteella. Tämä tarkoittaa yleensä sitä, että sinulla on jokin tiedosto, jolla on väärä omistajuus/käyttöoikeudet.

source: If you want to help identify if domain needs this access or you have a file with the wrong permissions on your system
fi: Jos haluat auttaa tunnistamaan, tarvitseeko toimialue tätä käyttöoikeutta vai onko järjestelmässäsi tiedosto, jolla on väärät käyttöoikeudet

source: turn on full auditing to get path information about the offending file and generate the error again.
fi: ota täysi auditointi käyttöön saadaksesi polkutiedot loukkaavasta tiedostosta ja luo virhe uudelleen.

source: Turn on full auditing # auditctl -w /etc/shadow -p w Try to recreate AVC. Then execute # ausearch -m avc -ts recent If you see PATH record check ownership/permissions on file, and fix it, otherwise report as a bugzilla.
fi: Ota käyttöön täysi auditointi # auditctl -w /etc/shadow -p w Yritä luoda AVC uudelleen. Suorita sitten # ausearch -m avc -ts recent Jos näet PATH-tietueen, tarkista tiedoston omistajuus/oikeudet ja korjaa se, ilmoita muutoin virhe bugzillaan.

source: SELinux is preventing $SOURCE_PATH "$ACCESS" access to device $TARGET_PATH.
fi: SELinux estää $SOURCE_PATH:n "$ACCESS" pääsyn laitteelle $TARGET_PATH.

source: SELinux has denied $SOURCE "$ACCESS" access to device $TARGET_PATH. $TARGET_PATH is mislabeled, this device has the default label of the /dev directory, which should not happen. All Character and/or Block Devices should have a label. You can attempt to change the label of the file using restorecon -v '$TARGET_PATH'. If this device remains labeled device_t, then this is a bug in SELinux policy. Please file a bug report. If you look at the other similar devices labels, ls -lZ /dev/SIMILAR, and find a type that would work for $TARGET_PATH, you can use chcon -t SIMILAR_TYPE '$TARGET_PATH', If this fixes the problem, you can make this permanent by executing semanage fcontext -a -t SIMILAR_TYPE '$FIX_TARGET_PATH' If the restorecon changes the context, this indicates that the application that created the device, created it without using SELinux APIs. If you can figure out which application created the device, please file a bug report against this application.
fi: SELinux on evännyt $SOURCE "$ACCESS" -käyttöoikeuden laitteelle $TARGET_PATH. $TARGET_PATH on nimiöity väärin, tällä laitteella on hakemiston /dev oletusnimiö, eikä niin pitäisi tapahtua. Kaikilla merkki- ja/tai lohkolaitteilla tulisi olla nimiö. Voit yrittää muuttaa tiedoston nimiötä käyttämällä restorecon -v '$TARGET_PATH'. Jos tämän laitteen nimiö on yhä device_t, silloin vika on SELinux-käytännössä. Lähetä virheraportti. Jos tarkastelet muita vastaavia laitteita, ls -lZ /dev/SIMILAR ja löydät tyypin, joka toimisi kohteelle $TARGET_PATH, voit käyttää komentoa: chcon -t SAMANKALTAINEN_TYYPPI '$TARGET_PATH'. Jos tämä korjaa ongelman, voit tehdä siitä pysyvän suorittamalla komennon: semanage fcontext -a -t SAMANKALTAINEN_TYYPPI '$FIX_TARGET_PATH' Jos restorecon muuttaa kontekstia, se tarkoittaa, että laitteen luonut sovellus loi sen käyttämättä SELinux-sovellusliittymiä. Jos pystyt selvittämään, mikä sovellus loi laitteen, lähetä virheraportti koskien tätä sovellusta.

source: Attempt restorecon -v '$TARGET_PATH' or chcon -t SIMILAR_TYPE '$TARGET_PATH'
fi: Yritä restorecon -v '$TARGET_PATH' tai chcon -t SAMANKALTAINEN_TYYPPI '$TARGET_PATH'

source: You need to change the label on $TARGET_PATH to a type of a similar device.
fi: Sinun on vaihdettava $TARGET_PATH -nimiö vastaavanlaiseksi laitteeksi.

source: # semanage fcontext -a -t SIMILAR_TYPE '$FIX_TARGET_PATH' # restorecon -v '$FIX_TARGET_PATH'
fi: # semanage fcontext -a -t SAMANKALTAINEN_TYYPPI '$FIX_TARGET_PATH' # restorecon -v '$FIX_TARGET_PATH'

source: Disable IPV6 properly.
fi: Ota IPV6 pois käytöstä oikein.

source: If you want to disable IPV6 on this machine
fi: Jos haluat poistaa IPV6:n käytöstä tältä koneelta

source: you need to set /proc/sys/net/ipv6/conf/all/disable_ipv6 to 1 and do not disable the ipv6 kernel module'
fi: Sinun on asetettava /proc/sys/net/ipv6/conf/all/disable_ipv6 arvoksi 1, äläkä poista ipv6-kernelimoduulia käytöstä.

source: Add net.ipv6.conf.all.disable_ipv6 = 1 to /etc/sysctl.conf
fi: Lisää net.ipv6.conf.all.disable_ipv6 = 1 tiedostoon: /etc/sysctl.conf

source: SELinux is preventing access to a file labeled unlabeled_t.
fi: SELinux estää pääsyn tiedostoon, jonka nimiö on unlabeled_t.

source: SELinux permission checks on files labeled unlabeled_t are being denied. unlabeled_t is a context the SELinux kernel gives to files that do not have a label. This indicates a serious labeling problem. No files on an SELinux box should ever be labeled unlabeled_t. If you have just added a disk drive to the system, you can relabel it using the restorecon command. For example if you saved the home directory from a previous installation that did not use SELinux, 'restorecon -R -v /home' will fix the labels. Otherwise you should relabel the entire file system.
fi: unlabeled_t -merkinnällä varustettujen tiedostojen SELinux-käyttöoikeustarkistukset on kielletty. unlabeled_t on konteksti, jonka SELinux-ydin antaa tiedostoille joilla ei ole nimiötä. Tämä ilmaisee vakavaa nimiöongelmaa. Mitään SELinux laatikossa olevaa tiedostoa ei saa koskaan nimiöidä unlabeled_t. Jos olet juuri lisännyt levyaseman järjestelmään, voit nimiöidä sen uudelleen käyttämällä restorecon-komentoa. Esimerkiksi jos tallensit kotihakemiston edellisestä asennuksesta, joka ei käyttänyt SELinuxia, 'restorecon -R -v /home' korjaa nimiöt. Muuten sinun pitäisi nimiöidä koko tiedostojärjestelmä uudelleen.

source: You can execute the following command as root to relabel your computer system: "touch /.autorelabel; reboot"
fi: Uudelleenmäärittääksesi nimiön voit suorittaa seuraavan komennon pääkäyttäjänä tietokonejärjestelmässä: "touch /.autorelabel; reboot"

source: This is caused by a newly created file system.
fi: Tämän aiheuttaa juuri luotu tiedostojärjestelmä.

source: If you think this is caused by a badly mislabeled machine.
fi: Jos luulet tämän johtuvan huonosti väärinnimiöidystä koneesta.

source: you need to add labels to it.
fi: sinun on lisättävä siihen nimiöitä.

source: you need to fully relabel.
fi: sinun täytyy täydellisesti uudelleen määrittää nimiö.

source: Try to fix the label.
fi: Yritä korjata nimiö.

source: Relabel the whole file system. Includes reboot!
fi: Uudelleen määritä koko tiedostojärjestelmän nimiö. Sisältää uudelleenkäynnistyksen!

source: SELinux is preventing $SOURCE_PATH from creating a file with a context of $SOURCE_TYPE on a filesystem.
fi: SELinux estää $SOURCE_PATH:ia luomasta tiedostoa, jonka konteksti on $SOURCE_TYPE, tiedostojärjestelmään.

source: SELinux is preventing $SOURCE from creating a file with a context of $SOURCE_TYPE on a filesystem. Usually this happens when you ask the cp command to maintain the context of a file when copying between file systems, "cp -a" for example. Not all file contexts should be maintained between the file systems. For example, a read-only file type like iso9660_t should not be placed on a r/w system. "cp -p" might be a better solution, as this will adopt the default file context for the destination.
fi: SELinux estää $SOURCE:a luomasta tiedostoa, jonka konteksti on $SOURCE_TYPE, tiedostojärjestelmään. Yleensä näin tapahtuu, kun pyydät cp-komentoa ylläpitämään tiedoston kontekstia kopioitaessa tiedostojärjestelmien välillä, esimerkiksi "cp -a". Kaikkia tiedostokonteksteja ei pidä ylläpitää tiedostojärjestelmien välillä. Esimerkiksi vain-luku-tyyppistä tiedostotyyppiä, kuten iso9660_t, ei tule sijoittaa r/w-järjestelmään. "cp -p" saattaa olla parempi ratkaisu, koska se hyväksyy oletustiedostokontekstin määränpäässä.

source: Use a command like "cp -p" to preserve all permissions except SELinux context.
fi: Käytä komentoa "cp -p" säilyttääksesi kaikki muut oikeudet paitsi SELinux-kontekstin.

source: If you believe $SOURCE_BASE_PATH should be allowed to create $TARGET_BASE_PATH files
fi: Jos uskot, että $SOURCE_BASE_PATH:in pitäisi sallia luoda $TARGET_BASE_PATH tiedostoja

source: you need to use a different command. You are not allowed to preserve the SELinux context on the target file system.
fi: sinun on käytettävä eri komentoa. Sinun ei sallita säilyttää SELinux-kontekstia kohdetiedostojärjestelmässä.

source: use a command like "cp -p" to preserve all permissions except SELinux context.
fi: käytä komentoa "cp -p" säilyttääksesi kaikki muut oikeudet paitsi SELinux-kontekstin.

source: SELinux is preventing the http daemon from sending mail.
fi: SELinux estää http-daemonia lähettämästä sähköpostia.

source: SELinux has denied the http daemon from sending mail. An httpd script is trying to connect to a mail port or execute the sendmail command. If you did not setup httpd to sendmail, this could signal an intrusion attempt.
fi: SELinux on estänyt http-daemonia lähettämästä sähköpostia. httpd-komentosarja yrittää muodostaa yhteyden postiporttiin tai suorittaa sendmail-komentoa. Jos et määrittänyt httpd:tä sendmailille, tämä voi olla merkki tunkeutumisyrityksestä.

source: If you want httpd to send mail you need to turn on the $BOOLEAN boolean: "setsebool -P $BOOLEAN=1"
fi: Jos haluat, että httpd lähettää sähköpostia, sinun on asetettava $BOOLEAN totuusarvo: "setsebool -P $BOOLEAN=1"

source: If you want to allow httpd to send mail
fi: Jos haluat sallia httpd:n lähettää sähköpostia

source: you must setup SELinux to allow this
fi: SELinux on määritettävä tämän sallimiseksi

source: SELinux prevented httpd $ACCESS access to http files.
fi: SELinux esti httpd $ACCESS -käyttöoikeuden http-tiedostoihin.

source: SELinux prevented httpd $ACCESS access to http files. Ordinarily httpd is allowed full access to all files labeled with http file context. This machine has a tightened security policy with the $BOOLEAN turned off, this requires explicit labeling of all files. If a file is a cgi script it needs to be labeled with httpd_TYPE_script_exec_t in order to be executed. If it is read only content, it needs to be labeled httpd_TYPE_content_t. If it is writable content, it needs to be labeled httpd_TYPE_script_rw_t or httpd_TYPE_script_ra_t. You can use the chcon command to change these context. Please refer to the man page "man httpd_selinux" or <a href="http://fedora.redhat.com/docs/selinux-apache-fc3">FAQ</a> "TYPE" refers to one of "sys", "user" or "staff" or potentially other script types.
fi: SELinux esti httpd $ACCESS-käyttöoikeuden http-tiedostoihin. Tavallisesti httpd saa täyden pääsyn kaikkiin tiedostoihin, jotka on merkitty http-tiedostoyhteydellä. Tällä koneella on tiukennettu turvallisuuspolitiikka $BOOLEAN kytkettynä pois päältä, tämä edellyttää kaikkien tiedostojen nimenomaista nimiöintiä. Jos tiedosto on cgi-komentosarja, se on nimiöitävä komennolla: httpd_TYYPPI_script_exec_t jotta se suoritetaan. Jos se on luettavaa sisältöä, se on nimiöitävä httpd_TYYPPI_content_t. Jos se on kirjoitettavaa sisältöä, se on nimiöitävä httpd_TYYPPI_script_rw_t tai httpd_TYYPPI_script_ra_t. Voit käyttää chcon-komentoa muuttaaksesi tätä kontekstia. Katso man-sivua "mam httpd_selinux" tai <a href="http://fedora.redhat.com/docs/selinux-apache-fc3">UKK</a> "TYYPPI" viittaa johonkin "sys", "käyttäjä" tai "henkilöstö" tai mahdollisesti muuhun komentotyyppiin.

source: Changing the "$BOOLEAN" boolean to true will allow this access: "setsebool -P $BOOLEAN=1"
fi: ”$BOOLEAN”-totuusarvon vaihtaminen todeksi sallii tämän käyttöoikeuden: ”setsebool -P $BOOLEAN=1”

source: If you want to allow httpd to execute cgi scripts and to unify HTTPD handling of all content files.
fi: Jos haluat sallia httpd:n suorittaa cgi-komentosarjoja ja yhtenäistää kaikkien sisältötiedostojen HTTPD-käsittelyn.

source: you must tell SELinux about this by enabling the 'httpd_unified' and 'http_enable_cgi' booleans
fi: sinun pitää kertoa SELinuxille tästä ottamalla 'httpd_unified' ja 'http_enagle_cgi' totuusarvot käyttöön

source: SELinux prevented httpd $ACCESS access to $TARGET_PATH. httpd scripts are not allowed to write to content without explicit labeling of all files. If $TARGET_PATH is writable content. it needs to be labeled httpd_sys_rw_content_t or if all you need is append you can label it httpd_sys_ra_content_t. Please refer to 'man httpd_selinux' for more information on setting up httpd and selinux.
fi: SELinux esti httpd $ACCESS-käyttöoikeuden kohteeseen $TARGET_PATH. httpd-komentosarjat ei saa kirjoittaa sisältöön ilman kaikkien tiedostojen nimenomaista nimiöintiä. Jos $TARGET_PATH on kirjoitettissa olevaa sisältöä, se on merkittävä tunnisteella httpd_sys_rw_content_t tai jos haluat vain lisätä sisältöä, voit merkitä sen nimiöksi httpd_sys_ra_content_t. Katso "man httpd_selinux" saadaksesi lisätietoja httpd: n ja SELinuxin määrittämisestä.

source: You need to change the label on '$FIX_TARGET_PATH'
fi: Sinun on vaihdettava nimiö kohteessa '$FIX_TARGET_PATH'

source: Your system may be seriously compromised! $SOURCE_PATH tried to modify kernel configuration.
fi: Järjestelmäsi saattaa olla vakavasti vaarantunut! $SOURCE_PATH yritti muokata ytimen kokoonpanoa.

source: SELinux has prevented $SOURCE from modifying $TARGET. This denial indicates $SOURCE was trying to modify the way the kernel runs or to actually insert code into the kernel. All applications that need this access should have already had policy written for them. If a compromised application tries to modify the kernel this AVC will be generated. This is a serious issue. Your system may very well be compromised.
fi: SELinux on estänyt $SOURCE:a muokkaamasta $TARGET:ia. Tämä kieltäminen antaa ymmärtää, että $SOURCE yritti muokata ytimen toimintaa tai lisätä koodia ytimeen. Kaikkilla sovelluksilla, jotka tarvitsevat tätä oikeutta, pitäisi jo olla tätä varten laadittu käytäntö. Vaarantuneen sovelluksen yritys muokata ydintä aiheuttaa tämän AVC:n luomisen. Tämä on vakava asia. Järjestelmäsi voi hyvinkin olla vaarantunut.

source: If you do not think $SOURCE_BASE_PATH should try $ACCESS access on $TARGET_BASE_PATH.
fi: Jos et usko, että $SOURCE_BASE_PATH:in pitäisi yrittää $ACCESS -pääsyä kohteeseen $TARGET_BASE_PATH.

source: you may be under attack by a hacker, since confined applications should not need this access.
fi: voit olla hakkerin hyökkäyksen kohteena, koska rajoitettujen sovellusten ei pitäisi tarvita tätä käyttöoikeutta.

source: SELinux is preventing $SOURCE_PATH access to a leaked $TARGET_PATH file descriptor.
fi: SELinux estää $SOURCE_PATH:n pääsyn vuotaneeseen $TARGET_PATH -tiedostokuvaukseen.

source: SELinux denied access requested by the $SOURCE command. It looks like this is either a leaked descriptor or $SOURCE output was redirected to a file it is not allowed to access. Leaks usually can be ignored since SELinux is just closing the leak and reporting the error. The application does not use the descriptor, so it will run properly. If this is a redirection, you will not get output in the $TARGET_PATH. You should generate a bugzilla on selinux-policy, and it will get routed to the appropriate package. You can safely ignore this avc.
fi: SELinux eväsi $SOURCE-komennon pyytämän pääsyn. Näyttää siltä, että tämä on joko vuotanut kuvaaja tai $SOURCE-lähtö ohjataan tiedostoon, johon ei ole pääsyä. Vuodot voidaan yleensä jättää huomiotta, koska SELinux vain sulkee vuodon ja ilmoittaa virheestä. Sovellus ei käytä kuvaajaa, joten se toimii oikein. Jos tämä on uudelleenohjaus, et saa ulostuloa $TARGET_PATH. Sinun tulisi luoda bugzilla selinux-policy-ohjelmassa, ja se ohjataan sopivaan pakettiin. Voit ohittaa tämän avc:n turvallisesti.

source: You can generate a local policy module to allow this access - see <a href="http://docs.fedoraproject.org/selinux-faq-fc5/#id2961385">FAQ</a>
fi: Voit luoda paikallisen käytäntömoduulin tämän pääsyn sallimiseksi katso <a href="http://docs.fedoraproject.org/selinux-faq-fc5/#id2961385">UKK</a>
