Repository: codacy-open-source-projects-scans/setroubleshoot-plugins
Catalog: po/*.po
Languages: fi

source: SELinux policy is preventing an httpd script from writing to a public directory.
fi: SELinux-käytäntö estää httpd-skriptiä kirjoittamasta julkiseen hakemistoon.

source: SELinux policy is preventing an httpd script from writing to a public directory. If httpd is not setup to write to public directories, this could signal an intrusion attempt.
fi: SELinux käytäntö estää kirjoittamaasta httpd-skriptiä julkiseen hakemistoon. Jos httpd:tä ei ole asetettu kirjoittamaan julkiseen hakemistoon, tämä voi olla merkki hyökkäys yrityksestä.

source: If httpd scripts should be allowed to write to public directories you need to turn on the $BOOLEAN boolean and change the file context of the public directory to public_content_rw_t. Read the httpd_selinux man page for further information: "setsebool -P $BOOLEAN=1; chcon -t public_content_rw_t <path>" You must also change the default file context labeling files on the system in order to preserve public directory labeling even on a full relabel. "semanage fcontext -a -t public_content_rw_t <path>"
fi: Jos httpd-komentosarjojen pitäisi sallia kirjoittaa julkisiin hakemistoihin, sinun on kytkettävä $BOOLEAN totuusarvo päälle ja muutettava julkisen hakemiston tiedostokontekstiksi public_content_rw_t. Katso httpd_selinux man-sivulta lisätietoja: "setsebool -P $ BOOLEAN = 1; chcon -t public_content_rw_t <polku>" Sinun on myös muutettava järjestelmän oletustiedostotunnistetiedostot, jotta julkisten hakemistojen merkinnät voidaan säilyttää myös täydellä uudelleetunnisteella. "semanage fcontext -a -t public_content_rw_t <polku>"

source: If you want to allow $SOURCE_PATH to be able to write to shared public content
fi: Jos haluat, että $SOURCE_PATH voi kirjoittaa jaettuun julkiseen sisältöön

source: you need to change the label on $TARGET_PATH to public_content_rw_t, and potentially turn on the allow_httpd_sys_script_anon_write boolean.
fi: sinun on vaihdettava nimiön $TARGET_PATH arvoksi public_content_rw_t ja mahdollisesti otettava käyttöön totuusarvo allow_httpd_sys_script_anon_write.

source: SELinux is preventing $SOURCE_PATH from changing the access protection of memory on the heap.
fi: SELinux estää $SOURCE_PATH muuttamasta pinossa olevan muistin pääsyoikeuksia.

source: The $SOURCE application attempted to change the access protection of memory on the heap (e.g., allocated using malloc). This is a potential security problem. Applications should not be doing this. Applications are sometimes coded incorrectly and request this permission. The <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux Memory Protection Tests</a> web page explains how to remove this requirement. If $SOURCE does not work and you need it to work, you can configure SELinux temporarily to allow this access until the application is fixed. Please file a bug report against this package.
fi: $SOURCE -sovellus yritti muuttaa keon muistin käytön suojausta (esim. varattu mallocilla). Tämä on potentiaalinen turvallisuus ongelma. Sovellusten ei pitäisi tehdä tätä. Sovellukset ovat joskus koodattu väärin ja pyytävät tätä lupaa. <a href="http://people.redhat.com/drepper/selinux-mem.html"> SELinux-muistisuojatestit </a> verkkosivulla kerrotaan, kuinka tämä vaatimus poistetaan. Jos $SOURCE ei toimi ja tarvitset sitä, voit määrittää SELinuxin tilapäisesti sallimaan tämän käyttöoikeuden, kunnes sovellus on korjattu. Lähetä vikaraportti tämän paketin osalta.

source: If you want $SOURCE to continue, you must turn on the $BOOLEAN boolean. Note: This boolean will affect all applications on the system.
fi: Jos haluat sovelluksen $SOURCE jatkavan, totuusarvo $BOOLEAN on asetettava todeksi. Huomaa: Tämä totuusarvo vaikuttaa kaikkiin järjestelmän sovelluksiin.

source: If you do not think $SOURCE_PATH should need to map heap memory that is both writable and executable.
fi: Jos et usko, että $SOURCE_PATH tarvitsee kartoittaa pinomuistia, joka on sekä kirjoitettavissa että suoritettavissa.

source: you need to report a bug. This is a potentially dangerous access.
fi: sinun pitää ilmoittaa ohjelmavirheestä. Tämä on mahdollisesti vaarallinen pääsyoikeus.

source: Contact your security administrator and report this issue.
fi: Ota yhteyttä turvallisuudesta vastaavaan pääkäyttäjään kertoaksesi tästä ongelmasta.

source: SELinux is preventing $SOURCE_PATH from loading $TARGET_PATH which requires text relocation.
fi: SELinux estää $SOURCE_PATH lataamasta $TARGET_PATH, mikä edellyttää tekstin sijainnin muuttamista.

source: The $SOURCE application attempted to load $TARGET_PATH which requires text relocation. This is a potential security problem. Most libraries do not need this permission. Libraries are sometimes coded incorrectly and request this permission. The <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux Memory Protection Tests</a> web page explains how to remove this requirement. You can configure SELinux temporarily to allow $TARGET_PATH to use relocation as a workaround, until the library is fixed. Please file a bug report.
fi: $SOURCE -sovellus yritti ladata $TARGET_PATH, joka vaatii tekstin siirtämistä. Tämä on mahdollinen turvallisuusongelma. Suurin osa kirjastoista ei tarvitse tätä lupaa. Kirjastot ovat joskus koodattu väärin ja pyytävät tätä lupaa. <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux-muistisuojatestit</a> verkkosivulla kerrotaan, kuinka tämä vaatimus poistetaan. Voit määrittää SELinux:in tilapäisesti niin, että $TARGET_PATH voi käyttää uudelleensijoittamista, kunnes kirjasto on korjattu. Lähetä virheraportti asiasta.

source: The $SOURCE application attempted to load $TARGET_PATH which requires text relocation. This is a potential security problem. Most libraries should not need this permission. The <a href="http://people.redhat.com/drepper/selinux-mem.html"> SELinux Memory Protection Tests</a> web page explains this check. This tool examined the library and it looks like it was built correctly. So setroubleshoot can not determine if this application is compromised or not. This could be a serious issue. Your system may very well be compromised. Contact your security administrator and report this issue.
fi: $SOURCE -sovellus yritti ladata $TARGET_PATH:n joka vaatii tekstin siirtämistä. Tämä on mahdollinen turvallisuusongelma. Suurimman osan kirjastoista ei pitäisi tarvita tätä lupaa. <a href="http://people.redhat.com/drepper/selinux-mem.html"> SELinux-muistisuojatestit</a> verkkosivu selittää tämän tarkistuksen. Tämä työkalu tutki kirjastoa ja näyttää kuin se olisi rakennettu oikein. Joten setroubleshoot ei voi määrittää, onko tämä sovellus vaarantunut vai ei. Tämä voi olla vakava asia. Sinun järjestelmäsi voi hyvinkin olla vaarantunut. Ota yhteyttä turvallisuudesta vastaavaan järjestelmänvalvojaan ja ilmoita tästä ongelmasta.

source: If you trust $TARGET_PATH to run correctly, you can change the file context to textrel_shlib_t. "chcon -t textrel_shlib_t '$TARGET_PATH'" You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t textrel_shlib_t '$FIX_TARGET_PATH'"
fi: Jos luotat siihen, että $TARGET_PATH toimii oikein, voit muuttaa tiedoston kontekstin kohteeseen textrel_shlib_t. "chcon -t textrel_shlib_t '$TARGET_PATH' " Sinun on myös muutettava järjestelmän oletustiedostokontekstit, jotta ne säilyvät myös täydellä uudelleennimiöinnissä. "semanage fcontext -a -t textrel_shlib_t '$FIX_TARGET_PATH" "

source: Change label on the library.
fi: Muuta kirjaston nimiötä.

source: SELinux is preventing $SOURCE_PATH from making the program stack executable.
fi: SELinux estää $SOURCE_PATH: ta muuttamasta ohjelmapinoa suoritettavaksi.

source: The $SOURCE application attempted to make its stack executable. This is a potential security problem. This should never ever be necessary. Stack memory is not executable on most OSes these days and this will not change. Executable stack memory is one of the biggest security problems. An execstack error might in fact be most likely raised by malicious code. Applications are sometimes coded incorrectly and request this permission. The <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux Memory Protection Tests</a> web page explains how to remove this requirement. If $SOURCE does not work and you need it to work, you can configure SELinux temporarily to allow this access until the application is fixed. Please file a bug report.
fi: $SOURCE -sovellus yritti tehdä pinonsa suoritettava. Tämä on mahdollinen turvallisuusongelma. Tämän ei koskaan pitäisi olla tarpeen. Pino-muistia ei voi nykyään suorittaa useimmissa käyttöjärjestelmissä, eikä se tule muuttumaankaan. Suoritettava pinomuisti on yksi suurimmista turvallisuusongelmista. Execstack-virhe on itse asiassa todennäköisesti haittaohjelman aiheuttama. Sovellukset ovat joskus koodattu väärin ja pyytävät tätä lupaa. <a href="http://people.redhat.com/drepper/selinux-mem.html">SELinux-muistisuojatestit</a> verkkosivulla kerrotaan, kuinka tämä vaatimus poistetaan. Jos $SOURCE ei tarvitsee sitä toimiakseen, voit määrittää SELinuxin väliaikaisesti sallimaan tämän pääsyn, kunnes sovellus on korjattu. Lähetä virheraportti asiasta.

source: Sometimes a library is accidentally marked with the execstack flag, if you find a library with this flag you can clear it with the execstack -c LIBRARY_PATH. Then retry your application. If the app continues to not work, you can turn the flag back on with execstack -s LIBRARY_PATH.
fi: Joskus kirjasto on vahingossa merkitty execstack-lipulla, jos löydät kirjaston, jossa on tämä lippu, voit tyhjentää sen suorittamalla execstack -c LIBRARY_PATH. Yritä sitten suorittaa sovellus uudelleen. Jos sovellus ei edelleenkä toimi, voit ottaa lipun takaisin käyttöön suorittamalla execstack -s LIBRARY_PATH.

source: If you do not think $SOURCE_PATH should need to map stack memory that is both writable and executable.
fi: Jos et usko, että $SOURCE_PATH tarvitsee kartoittaa pinomuistia, joka on sekä kirjoitettavissa että suoritettavissa.

source: you need to report a bug. This is a potentially dangerous access.
fi: sinun pitää ilmoittaa ohjelmavirheestä. Tämä on mahdollisesti vaarallinen pääsyoikeus.

source: If you believe that %s should not require execstack
fi: Jos uskot ettei %s pitäisi vaatia execstack:ia

source: you should clear the execstack flag and see if $SOURCE_PATH works correctly. Report this as a bug on %s. You can clear the exestack flag by executing:
fi: sinun pitäisi tyhjentää execstack-lippu ja tarkistaa, toimiiko $SOURCE_PATH oikein. Ilmoita tästä virheestä osoitteessa %s. Voit tyhjentää exestack-lipun suorittamalla:

source: SELinux prevented the ftp daemon from $ACCESS files stored on a CIFS filesystem.
fi: SELinux esti ftp-palvelulta pääsyn $ACCESS CIFS-tiedostojärjestelmään tallennettuihin tiedostoihin.

source: SELinux prevented the ftp daemon from $ACCESS files stored on a CIFS filesystem. CIFS (Comment Internet File System) is a network filesystem similar to SMB (<a href="http://www.microsoft.com/mind/1196/cifs.asp">http://www.microsoft.com/mind/1196/cifs.asp</a>) The ftp daemon attempted to read one or more files or directories from a mounted filesystem of this type. As CIFS filesystems do not support fine-grained SELinux labeling, all files and directories in the filesystem will have the same security context. If you have not configured the ftp daemon to read files from a CIFS filesystem this access attempt could signal an intrusion attempt.
fi: SELinux esti ftp-palvelulta pääsyn $ACCESS CIFS-tiedostojärjestelmään tallennettuihin tiedostoihin. CIFS (Comment Internet File System) on samankaltainen verkkotiedostojärjestelmä kuin SMB (<a href="http://www.microsoft.com/mind/1196/cifs.asp">http://www.microsoft.com/mind/1196/cifs.asp</a>) Ftp-demoni yritti lukea yhtä tai useampaa tiedostoa tai hakemistoa tämän tyyppisestä liitetystä tiedostojärjestelmästä. Koska CIFS-tiedostojärjestelmät eivät tue hienorakeista SELinux-nimiöintiä, kaikilla tiedostoilla ja hakemistoilla tiedostojärjestelmässä on sama suojauskonteksti. Jos et ole määrittänyt ftp-palvelua lukemaan tiedostoja CIFS-tiedostojärjestelmästä tämä pääsyyritys voi merkitä tunkeutumisyritystä.

source: Changing the "$BOOLEAN" boolean to true will allow this access: "setsebool -P $BOOLEAN=1."
fi: ”$BOOLEAN”-totuusarvon vaihtaminen todeksi sallii tämän käyttöoikeuden: ”setsebool -P $BOOLEAN=1.”

source: Changing the "$BOOLEAN" and "$WRITE_BOOLEAN" booleans to true will allow this access: "setsebool -P $BOOLEAN=1 $WRITE_BOOLEAN=1". warning: setting the "$WRITE_BOOLEAN" boolean to true will allow the ftp daemon to write to all public content (files and directories with type public_content_t) in addition to writing to files and directories on CIFS filesystems.
fi: Vaihtamalla "$BOOLEAN" ja "$WRITE_BOOLEAN" -totuusarvot todeksi antaa tämän käyttöoikeuden: "setsebool -P $BOOLEAN=1 $WRITE_BOOLEAN=1". varoitus: "$WRITE_BOOLEAN" -totuusarvon asettaminen todeksi antaa ftp-daemonille oikeuden kirjoittaa kaikkeen julkiseen sisältöön (tiedostot ja hakemistot, joiden tyyppi on public_content_t) CIFS-tiedostojärjestelmissä olevin tiedostojen ja hakemistojen kirjoitusoikeuden lisäksi.

source: If you want to allow ftpd to write to cifs file systems
fi: Jos haluat sallia ftpd: n kirjoittamisen cifs-tiedostojärjestelmiin

source: you must tell SELinux about this
fi: sinun pitää kertoa SELinuxille tästä

source: Enable booleans
fi: Ota totuusarvot käyttöön

source: SELinux prevented the ftp daemon from $ACCESS files stored on a NFS filesystem.
fi: SELinux esti ftp-palvelun pääsyn $ACCESS tiedostoihin, jotka on tallennettu NFS-tiedostojärjestelmään.

source: SELinux prevented the ftp daemon from $ACCESS files stored on a NFS filesystem. NFS (Network Filesystem) is a network filesystem commonly used on Unix / Linux systems. The ftp daemon attempted to read one or more files or directories from a mounted filesystem of this type. As NFS filesystems do not support fine-grained SELinux labeling, all files and directories in the filesystem will have the same security context. If you have not configured the ftp daemon to read files from a NFS filesystem this access attempt could signal an intrusion attempt.
fi: SELinux esti ftp-palvelun pääsyn $ACCESS tiedostoihin, jotka on tallennettu NFS-tiedostojärjestelmään. NFS (Network Filesystem) on verkkotiedostojärjestelmä, jota käytetään yleisesti Unix/Linux järjestelmissä. Ftp-demoni yritti lukea yhtä tai useampaa tiedostoa tai hakemistoa tämän tyyppisestä liitetystä tiedostojärjestelmästä. Koska NFS-tiedostojärjestelmät eivät tue hienorakeista SELinux-nimiöintiä, kaikilla tiedostoilla ja hakemistoilla tiedostojärjestelmässä on sama suojauskonteksti. Jos et ole määrittänyt ftp-palvelua lukemaan tiedostoja NFS-tiedostojärjestelmästä tämä pääsyyritys voi merkitä tunkeutumisyritystä.

source: Changing the "allow_ftpd_use_nfs" boolean to true will allow this access: "setsebool -P allow_ftpd_use_nfs=1."
fi: Totuusarvon "allow_ftpd_use_nfs" muuttaminen todeksi sallii tämän käyttöoikeuden: "setsebool -P allow_ftpd_use_nfs=1."

source: Changing the "allow_ftpd_use_nfs" and "ftpd_anon_write" booleans to true will allow this access: "setsebool -P allow_ftpd_use_nfs=1 ftpd_anon_write=1". warning: setting the "ftpd_anon_write" boolean to true will allow the ftp daemon to write to all public content (files and directories with type public_content_t) in addition to writing to files and directories on NFS filesystems.
fi: Totuusarvojen "allow_ftpd_use_nfs" ja "ftpd_anon_write" muuttaminen todeksi sallii tämän pääsyn: "setsebool -P allow_ftpd_use_nfs=1 ftpd_anon_write=1". varoitus: "ftpd_anon_write" -totuusarvon asettaminen todeksi sallii ftp-daemonin kirjoittaa kaikkeen julkiseen sisältöön (tiedostot ja hakemistot, joiden tyyppi on public_content_t) NFS-tiedostojärjestelmissä olevien tiedostojen ja hakemistojen kirjoitusoikeuden lisäksi.

source: If you want to allow ftpd to write to nfs file systems
fi: Jos haluat sallia ftpd:n kirjoittavan nfs-tiedostojärjestelmiin

source: Enable booleans.
fi: Ota totuusarvot käyttöön.

source: SELinux is preventing $SOURCE_PATH "$ACCESS" access to $TARGET_PATH.
fi: SELinux estää $SOURCE_PATH "$ACCESS" -käyttöoikeuden $TARGET_PATH -palveluun.

source: You tried to place a type on a %s that is not a file type. This is not allowed, you must assigne a file type. You can list all file types using the seinfo command. seinfo -afile_type -x
fi: Yritit sijoittaa kohteeseen %s tyypin, joka ei ole tiedostotyyppi. Tämä ei ole sallittua, sinun on määritettävä tiedostotyyppi. Voit luetella kaikki tiedostotyypit seinfo-komennolla. seinfo -afile_type -x

source: If you want to change the label of $TARGET_PATH to %s, you are not allowed to since it is not a valid file type.
fi: Et voi vaihtaa haluamaasi nimiötä $TARGET_PATH:stä %s:ksi, koska se ei ole kelvollinen tiedostotyyppi.

source: you must pick a valid file label.
fi: sinun on valittava kelvollinen tiedostonimiö.

source: SELinux is preventing the $SOURCE_PATH from executing potentially mislabeled files $TARGET_PATH.
fi: SELinux estää $SOURCE_PATH:ta suorittamasta mahdollisesti väärin nimiöityjä tiedostoja $TARGET_PATH.

source: SELinux has denied the $SOURCE_PATH from executing potentially mislabeled files $TARGET_PATH. Automounter can be setup to execute configuration files. If $TARGET_PATH is an automount executable configuration file it needs to have a file label of bin_t. If automounter is trying to execute something that it is not supposed to, this could indicate an intrusion attempt.
fi: SELinux estää $SOURCE_PATH:ta suorittamasta mahdollisesti väärin nimiöityjä tiedostoja $TARGET_PATH. Automounter voidaan asettaa suorittamaan määritystiedostot. Jos $TARGET_PATH on automaattisesti liitettävä suoritettava määritystiedosto sillä on oltava bin_t-tunniste. Jos automaattinen liittäjä yrittää suorittaa jotain, jota sen ei pitäisi, se voi viitata tunkeutumisyritykseen.

source: If you want to change the file context of $TARGET_PATH so that the automounter can execute it you can execute "chcon -t bin_t $TARGET_PATH". If you want this to survive a relabel, you need to permanently change the file context: execute "semanage fcontext -a -t bin_t '$FIX_TARGET_PATH'".
fi: Jos haluat muuttaa tiedoston $TARGET_PATH tiedostokontekstia, jotta automaattiliittäjä voi suorittaa sen, voit suorittaa "chcon -t bin_t $TARGET_PATH". Jos haluat tämän pysyvän voimassa myös nimiön uudestaan määrittämisen jälkeen, sinun on muutettava tiedostokonteksti pysyvästi: Suorita "semanage fcontext -a -t bin_t '$FIX_TARGET_PATH'".

source: Change file context.
fi: Muuta tiedoston kontekstia.

source: SELinux is preventing $SOURCE_PATH from binding to port $PORT_NUMBER.
fi: SELinux estää $SOURCE_PATH yhdistämästä porttiin $PORT_NUMBER.

source: SELinux has denied the $SOURCE from binding to a network port $PORT_NUMBER which does not have an SELinux type associated with it. If $SOURCE should be allowed to listen on $PORT_NUMBER, use the <i>semanage</i> command to assign $PORT_NUMBER to a port type that $SOURCE_TYPE can bind to (%s). If $SOURCE is not supposed to bind to $PORT_NUMBER, this could signal an intrusion attempt.
fi: SELinux on estänyt $SOURCE -palvelun sitoutumasta verkkoporttiin $ PORT_NUMBER, johon ei ole liitetty SELinux-tyyppiä. Jos $SOURCE -palvelun pitäisi sallia kuunnella osoitteessa $PORT_NUMBER, käytä komentoa <i> semanage </i> määrittämään $PORT_NUMBER porttityyppiin, johon $SOURCE_TYPE voi sitoutua (%s). Jos $SOURCE ei pitäisi sitoutua $PORT_NUMBER -palveluun, tämä voi tarkoittaa tunkeutumisyritystä.

source: If you want to allow $SOURCE to bind to port $PORT_NUMBER, you can execute # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER where PORT_TYPE is one of the following: %s. If this system is running as an NIS Client, turning on the allow_ypbind boolean may fix the problem. setsebool -P allow_ypbind=1.
fi: Jos haluat sallia $SOURCE -palvelun sitoutua porttiin $PORT_NUMBER, voit suorittaa komennon # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER missä PORT_TYPE on yksi seuraavista: %s. Jos tämä järjestelmä toimii NIS-asiakkaana, totuusarvon allow_ypbind ottaminen käyttöön voi korjata ongelman. setsebool -P allow_ypbind=1.

source: If you want to allow $SOURCE_PATH to bind to network port $PORT_NUMBER
fi: Jos haluat sallia $SOURCE_PATH:n sidonnan verkkoporttiin $PORT_NUMBER

source: # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER where PORT_TYPE is one of the following: %s.
fi: # semanage port -a -t PORT_TYPE -p %s $PORT_NUMBER missä PORT_TYPE on yksi seuraavista: %s.

source: SELinux is preventing $SOURCE_PATH "$ACCESS" access on $TARGET_PATH.
fi: SELinux estää $SOURCE_PATH "$ACCESS" pääsyn kohteeseen $TARGET_PATH.

source: SELinux denied access requested by $SOURCE. The current boolean settings do not allow this access. If you have not setup $SOURCE to require this access this may signal an intrusion attempt. If you do intend this access you need to change the booleans on this system to allow the access.
fi: SELinux eväsi $SOURCE:n pyytämän pääsyn. Nykyinen totuusarvo asetukset eivät salli tätä pääsyä. Jos et ole määrittänyt $SOURCE kohdetta pyytämään tätä pääsyä, tämä voi merkitä tunkeutumisyritystä. Jos tahdot tämän käyttöoikeuden, sinun on vaihdettava järjestelmän totuusarvoja salliaksesi tämän pääsyn.

source: Confined processes can be configured to run requiring different access, SELinux provides booleans to allow you to turn on/off access as needed.
fi: Rajoitetut prosessit voidaan konfiguroida suorittamaan niin, että pyytävät erilaista käyttöoikeutta, SELinux tarjoaa totuusarvot, joiden avulla voi tarpeen mukaan kytkeä päälle/pois päältä pääsyoikeuden.

source: If you want to %s
fi: Jos haluat kohteeseen %s

source: You must tell SELinux about this by enabling the '%s' boolean.
fi: Sinun pitää kertoa tästä SELinuxille ottamalla '%s' totuusarvo käyttöön.

source: You can read '%s' man page for more details.
fi: Voit lukea '%s' manuaalisivun saadaksesi lisää tietoa.

source: SELinux has denied the $SOURCE access to potentially mislabeled files $TARGET_PATH. This means that SELinux will not allow httpd to use these files. If httpd should be allowed this access to these files you should change the file context to one of the following types, %s. Many third party apps install html files in directories that SELinux policy cannot predict. These directories have to be labeled with a file context which httpd can access.
fi: SELinux on evännyt $SOURCE -käyttöoikeuden mahdollisesti väärin nimiöityihin tiedostoihin $TARGET_PATH. Tämä tarkoittaa, että SELinux ei anna httpd:n käyttää näitä tiedostoja. Jos httpd:lle pitäisi sallia tämä pääsy näihin tiedostoihin, sinun on vaihdettava tiedostokonteksti johonkin seuraavista tyyppeistä, %s. Monet kolmannen osapuolen sovellukset asentavat html-tiedostoja hakemistoihin, joita SELinux-käytäntö ei voi ennustaa. Nämä hakemistot on merkittävä tiedostokontekstilla, johon httpd pääsee.

source: You need to change the label on $FIX_TARGET_PATH
fi: Sinun on vaihdettava nimiö kohteessa $FIX_TARGET_PATH

source: # semanage fcontext -a -t FILE_TYPE '$FIX_TARGET_PATH' where FILE_TYPE is one of the following: %s. Then execute: restorecon -v '$FIX_TARGET_PATH'
fi: # semanage fcontext -a -t TIEDOSTO_TYYPPI '$FIX_TARGET_PATH' missä TIEDOSTO_TYYPPI on yksi seuvaavista: %s. Suorita sitten: restorecon -v '$FIX_TARGET_PATH'

source: SELinux is preventing $SOURCE_PATH "$ACCESS" access.
fi: SELinux estää $SOURCE_PATH "$ACCESS" pääsyn.
