Repository: codacy-open-source-projects-scans/setroubleshoot-plugins
Catalog: po/*.po
Languages: fi

source: If you want to ignore $SOURCE_BASE_PATH trying to $ACCESS access the $TARGET_BASE_PATH $TARGET_CLASS, because you believe it should not need this access.
fi: Jos haluat olla välittämättä, että $SOURCE_BASE_PATH yrittää $ACCESS pääsyä $TARGET_BASE_PATH $TARGET_CLASS, koska uskot, ettei sen pitäisi tarvita tätä käyttöoikeutta.

source: You should report this as a bug. You can generate a local policy module to dontaudit this access.
fi: Sinun tulisi ilmoittaa tästä virheenä. Voit luoda paikallisen käytäntömoduulin tämän auditoinnin poistamiseksi.

source: # ausearch -x $SOURCE_PATH --raw | audit2allow -D -M my-$SOURCE # semodule -X 300 -i my-$SOURCE.pp
fi: # ausearch -x $SOURCE_PATH --raw | audit2allow -D -M oma-$SOURCE # semodule -X 300 -i oma-$SOURCE.pp

source: Your system may be seriously compromised! $SOURCE_PATH attempted to mmap low kernel memory.
fi: Järjestelmäsi saattaa olla vakavasti vaarantunut! $SOURCE_PATH yritti mmapata ytimen alempaa muistialuetta.

source: SELinux has denied the $SOURCE the ability to mmap low area of the kernel address space. The ability to mmap a low area of the address space is configured by /proc/sys/kernel/mmap_min_addr. Preventing such mappings helps protect against exploiting null deref bugs in the kernel. All applications that need this access should have already had policy written for them. If a compromised application tries to modify the kernel, this AVC would be generated. This is a serious issue. Your system may very well be compromised.
fi: SELinux on estänyt $SOURCE:lta kyvyn kartoittaa ytimen matalan muistialueen osoitetilaa. Kyvyn kartoittaa matalan muistialueen osoitetila on määrittänyt /proc/sys/kernel/mmap_min_addr. Tällaisten kartoitusten estäminen auttaa suojaamaan ytimessä olevien nolla-virheiden hyödyntämiseltä. Kaikille sovelluksille, jotka tarvitsevat tämän käyttöoikeuden, olisi jo pitänyt laatia käytäntö sitä varten. Jos vaarantunut sovellus yrittää muokata ydintä, tämä AVC luodaan. Tämä on vakava asia. Järjestelmäsi voi hyvinkin olla vaarantunut.

source: If you do not think $SOURCE_PATH should need to mmap low memory in the kernel.
fi: Jos et usko, että $SOURCE_PATH:n pitäisi tarvita mmapata ytimen alempaa muistialuetta.

source: you may be under attack by a hacker, this is a very dangerous access.
fi: voit olla hakkerin hyökkäyksen kohteena, tämä on hyvin vaarallinen käyttöoikeus.

source: SELinux prevented $SOURCE from mounting on the file or directory "$TARGET_PATH" (type "$TARGET_TYPE").
fi: SELinux esti $SOURCE:a liittymästä tiedostoon tai hakemistoon "$ TARGET_PATH" (tyyppi "$ TARGET_TYPE").

source: SELinux prevented $SOURCE from mounting a filesystem on the file or directory "$TARGET_PATH" of type "$TARGET_TYPE". By default SELinux limits the mounting of filesystems to only some files or directories (those with types that have the mountpoint attribute). The type "$TARGET_TYPE" does not have this attribute. You can change the label of the file or directory.
fi: SELinux esti $SOURCE:a liittymästä tiedostojärjestelmään tiedostossa tai hakemistossa "$TARGET_PATH", jonka tyyppi on "$TARGET_TYPE". Oletuksena SELinux rajoittaa tiedostojärjestelmien liitokset vain joihinkin tiedostoihin tai hakemistoihin (ne, joiden tyypit sisältävät liitoskohtamääritteen). tyypillä "$TARGET_TYPE" ei ole tätä määritettä. Voit muuttaa tiedoston tai hakemiston nimiön.

source: Changing the file_context to mnt_t will allow mount to mount the file system: "chcon -t mnt_t '$TARGET_PATH'." You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t mnt_t '$FIX_TARGET_PATH'"
fi: Jos muutat file_context -asetukseksi mnt_t, komento mount voi liittää tiedostojärjestelmän: "chcon -t mnt_t '$TARGET_PATH'." Sinun on myös muutettava järjestelmän oletustiedostokontekstit, jotta ne säilyvät myös täydessä uudelleennimiöinnissä. "semanage fcontext -a -t mnt_t '$FIX_TARGET_PATH'"

source: If you want to allow $SOURCE_BASE_PATH to mount on $TARGET_BASE_PATH.
fi: Jos haluat sallia $SOURCE_BASE_PATH:n liittymisen kohteeseen $TARGET_BASE_PATH.

source: you must change the labeling on $TARGET_PATH.
fi: sinun on vaihdettava nimiö kohteeseen $TARGET_PATH.

source: SELinux denied access requested by $SOURCE. It is not expected that this access is required by $SOURCE and this access may signal an intrusion attempt. It is also possible that the specific version or configuration of the application is causing it to require additional access. mozplugger and spice-xpi run applications within mozilla-plugins that require access to the desktop, that the mozilla_plugin lockdown will not allow, so either you need to turn off the mozilla_plugin lockdown or not use these packages.
fi: SELinux eväsi $SOURCE:n pyytämän pääsyn. Ei odoteta, että $SOURCE tarvitsee tätä käyttöoikeutta, ja tämä pääsy voi merkitä tunkeutumisyritystä. On myös mahdollista, että sovelluksen tietyn version tai kokoonpanon vuoksi se vaatii lisäoikeuksia. mozplugger ja spice-xpi ajavat sovelluksia mozilla-laajennuksissa, jotka vaativat pääsyn työpöydälle, joita mozilla_plugin-lukitus ei salli, joten sinun on joko poistettava käytöstä mozilla_plugin-lukitus tai olla käyttämättä näitä paketteja.

source: Either remove the mozplugger or spice-xpi package by executing 'yum remove mozplugger spice-xpi' or turn off enforcement of SELinux over the Firefox plugins. setsebool -P unconfined_mozilla_plugin_transition 0
fi: Poista joko mozplugger- tai spice-xpi-paketti suorittamalla 'yum remove mozplugger spice-xpi' tai sammuta SELinuxin pakottaminen Firefox-laajennusten kautta: setsebool -P unconfined_mozilla_plugin_transition 0

source: you must turn off SELinux controls on the Firefox plugins.
fi: sinun on poistettava käytöstä SELinux-hallinta Firefox-laajennuksissa.

source: SELinux denied access requested by $SOURCE. It is not expected that this access is required by $SOURCE and this access may signal an intrusion attempt. It is also possible that the specific version or configuration of the application is causing it to require additional access.
fi: SELinux eväsi $SOURCE: n pyytämän pääsyn. Ei ole oletettavaa, että $SOURCE tarvitsisi tätä käyttöoikeutta ja tämän pyyntö voi merkitä tunkeutumisyritystä. On myös mahdollista, että erityinen sovelluksen versio tai kokoonpano aiheuttaa käyttöoikeuden lisäyksen pyynnön.

source: Either remove the mozplluger package by executing 'yum remove mozplugger' Or turn off enforcement of SELinux over the Firefox plugins. setsebool -P unconfined_mozilla_plugin_transition 0
fi: Joko poista mozplluger-paketti suorittamalla 'yum remove mozplugger' Tai sammuta SELinuxin pakottaminen Firefox-laajennusten kautta. setsebool -P unconfined_mozilla_plugin_transition 0

source: If you want to to continue using SELinux Firefox plugin containment rather then using mozplugger package
fi: Jos haluat jatkaa SELinux Firefox-laajennusrajoituksen käyttöä sen sijaan, että käytät mozplugger-pakettia

source: you must remove the mozplugger package.
fi: sinun pitää poistaa mozplugger-paketti.

source: SELinux denied access requested by $SOURCE. $TARGET_PATH may be mislabeled. openvpn is allowed to read content in home directory if it is labeled correctly.
fi: SELinux eväsi $SOURCE: n pyytämän pääsyn. $TARGET_PATH saattaa olla väärin nimiöity. openvpn saa lukea kotihakemiston sisältöä, jos se on nimiöity oikein.

source: You can restore the default system context to this file by executing the restorecon command. # restorecon -R /root/.ssh
fi: Voit palauttaa järjestelmän oletusympäristön tähän tiedostoon suorittamalla komento 'restorecon'. # restorecon -R /root/.ssh

source: If you want to mv $TARGET_BASE_PATH to standard location so that $SOURCE_BASE_PATH can have $ACCESS access
fi: Jos haluat siirtää $TARGET_BASE_PATH oletussijaintiin, jotta $SOURCE_BASE_PATH voi käyttää $ACCESS -käyttöoikeutta

source: If you want to modify the label on $TARGET_BASE_PATH so that $SOURCE_BASE_PATH can have $ACCESS access on it
fi: Jos haluat muokata $TARGET_BASE_PATH-nimiötä siten, että $SOURCE_BASE_PATH:lla voi olla $ACCESS-käyttöoikeus siihen

source: you must move the cert file to the ~/.cert directory
fi: sinun on siirrettävä varmennetiedosto ~/.cert-hakemistoon

source: you must fix the labels.
fi: sinun täytyy korjata nimiöt.

source: SELinux denied access to $TARGET_PATH requested by $SOURCE. $TARGET_PATH has a context used for sharing by a different program. If you would like to share $TARGET_PATH from $SOURCE also, you need to change its file context to public_content_t. If you did not intend to allow this access, this could signal an intrusion attempt.
fi: SELinux eväsi pääsyn $TARGET_PATH:een, jota $SOURCE pyysi. $TARGET_PATH sisältää kontekstin, jota käytetään jakamiseen toisen ohjelman kautta. Jos sinä haluaa jakaa myös $TARGET_PATH kohteesta $SOURCE, sinun täytyy muuta tiedostokontekstiksi public_content_t. Jos et aikonut sallia tätä pääsyä, se voi merkitä tunkeutumisyritystä.

source: You can alter the file context by executing chcon -t public_content_t '$TARGET_PATH' You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t public_content_t '$FIX_TARGET_PATH'"
fi: Voit muuttaa tiedoston kontekstia suorittamalla chcon -t public_content_t '$TARGET_PATH' Sinun on myös muutettava järjestelmän oletustiedostokontekstit, jotta ne säilyvät myös täydessä uudelleennimiöinnissä. "semanage fcontext -a -t public_content_t '$FIX_TARGET_PATH' "

source: If you want to treat $TARGET_BASE_PATH as public content
fi: Jos haluat käsitellä $TARGET_BASE_PATH:ia julkisena sisältönä

source: You need to change the label on $TARGET_BASE_PATH to public_content_t or public_content_rw_t.
fi: Sinun on vaihdettava nimiö kohteeseen $TARGET_BASE_PATH arvoksi public_content_t tai public_content_rw_t.

source: SELinux denied svirt access to the block device $TARGET_PATH. If this is a virtualization image, it needs to be labeled with a virtualization file context (virt_image_t). You can relabel $TARGET_PATH to be virt_image_t using chcon. You also need to execute semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH' to add this new path to the system defaults. If you did not intend to use $TARGET_PATH as a virtualization image it could indicate either a bug or an intrusion attempt.
fi: SELinux eväsi svirt-pääsyn lohkolaitteeseen $TARGET_PATH. Jos tämä on virtualisointilevykuva, se on nimiöitävä virtualisointitiedoston kontekstilla (virt_image_t). Voit nimiöidä $TARGET_PATH uudelleen virt_image_t:ksi chcon:illa. Sinun on myös suoritettava semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH' lisätäksesitämän uuden polun järjestelmän oletusasetuksiin. Jos et aikonut käyttää $TARGET_PATH virtualisointilevykuvana tämä voi olla merkki virhestä tai tunkeutumisyrityksestä.

source: You can alter the file context by executing chcon -t virt_image_t '$TARGET_PATH' You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH'"
fi: Voit muuttaa tiedoston kontekstia suorittamalla chcon -t virt_image_t '$TARGET_PATH' Sinun on myös muutettava järjestelmän oletustiedostokontekstit, jotta ne säilyvät myös täydessä uudelleennimiöinnissä. "semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH'"

source: Set the image label to virt_image_t.
fi: Aseta levykuvan nimiöksi virt_image_t.

source: SELinux denied svirt access to $TARGET_PATH. If this is a virtualization image, it has to have a file context label of virt_image_t. The system is setup to label image files in directory./var/lib/libvirt/images correctly. We recommend that you copy your image file to /var/lib/libvirt/images. If you really want to have your image files in the current directory, you can relabel $TARGET_PATH to be virt_image_t using chcon. You also need to execute semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH' to add this new path to the system defaults. If you did not intend to use $TARGET_PATH as a virtualization image it could indicate either a bug or an intrusion attempt.
fi: SELinux eväsi svirt-pääsyn kohteeseen $TARGET_PATH. Jos tämä on virtualisointilevykuva, sillä on oltava tiedoston kontekstinimiö virt_image_t. Järjestelmä on asetettu merkitsemään levykuvatiedostot hakemistoon. /var/lib/libvirt/images oikein. Suosittelemme, että kopioit levykuvatiedostosi hakemistoon /var/lib/libvirt/images. Jos todella haluat, että levykuvatiedostosi ovat nykyisessä hakemistossa, voit merkitä $TARGET_PATH uudelleen virt_image_t: ksi chcon:illa. Sinun on myös suoritettava semanage fcontext -a -t virt_image_t '$FIX_TARGET_PATH' lisätäksesi tämä uusi polku järjestelmän oletusasetuksiin. Jos et aikonut käyttää $TARGET_PATH virtualisointilevykuvana tämä voi olla joko virhen tai tunkeutumisyritys.

source: If $TARGET_BASE_PATH is a virtualization target
fi: Jos $TARGET_BASE_PATH on virtualisointikohde

source: You can restore the default system context to this file by executing the restorecon command. restorecon '$TARGET_PATH', if this file is a directory, you can recursively restore using restorecon -R '$TARGET_PATH'.
fi: Voit palauttaa järjestelmän oletuskontekstin tähän tiedostoon suorittamalla restorecon-komennon. restorecon '$TARGET_PATH', jos tämä tiedosto on hakemisto, voit palauttaa rekursiivisesti käyttämällä restorecon -R '$TARGET_PATH'.

source: SELinux denied access requested by $SOURCE. $TARGET_PATH may be mislabeled. $TARGET_PATH default SELinux type is <B>%s</B>, but its current type is <B>$TARGET_TYPE</B>. Changing this file back to the default type may fix your problem. <p> File contexts can be assigned to a file in the following ways. <ul> <li>Files created in a directory receive the file context of the parent directory by default. <li>The SELinux policy might override the default label inherited from the parent directory by specifying a process running in context A which creates a file in a directory labeled B will instead create the file with label C. An example of this would be the dhcp client running with the dhcpc_t type and creating a file in the directory /etc. This file would normally receive the etc_t type due to parental inheritance but instead the file is labeled with the net_conf_t type because the SELinux policy specifies this. <li>Users can change the file context on a file using tools such as chcon, or restorecon. </ul> This file could have been mislabeled either by user error, or if an normally confined application was run under the wrong domain. <p> However, this might also indicate a bug in SELinux because the file should not have been labeled with this type. <p> If you believe this is a bug, please file a bug report against this package.
fi: SELinux eväsi $SOURCE:n pyytämän pääsyn. $TARGET_PATH saattaa olla väärin nimiöity. $TARGET_PATH SELinuxin oletustyyppi on <B>%s</B>, mutta sen nykyinen tyyppi on <B>$TARGET_TYPE</B>. Tämä tiedosto vaihtaminen takaisin oletustyyppiin voi korjata ongelmasi. <p> Tiedostokontekstit voidaan määrittää tiedostolle seuraavilla tavoilla. <ul> <li>Hakemistoon luodut tiedostot vastaanottavat oletuksena isäntähakemiston tiedostokontekstin. <li>SELinux-käytäntö saattaa ohittaa isäntähakemista perityn oletusnimiön määrittämällä kontekstissa A käynnissä oleva prosessin, joka luo tiedoston hakemistoon joko on nimiöity B sen sijaan luo tiedoston nimiöllä C. Esimerkki tästä on käynnissä oleva dhcp-asiakas dhcpc_t-tyypillä joka luo tiedoston hakemistoon /etc. Tämä tiedosto saisi normaalisti etc_t-tyypin isännältä perittynä, mutta sen sijaan tiedosto nimiöidään net_conf_t-tyypillä, koska SELinux-käytäntö määrittelee näin. <li>Käyttäjät voivat muuttaa tiedoston tiedostokontekstia esimerkiksi chcon- tai restorecon-työkaluilla. </ul> Tämä tiedosto on voitu nimiöidä väärin joko käyttäjän virheestä tai normaalisti suljettua sovellusta ajettiin väärässä toimialueessa. <p> Tämä saattaa kuitenkin osoittaa myös virheen SELinuxissa, koska tiedostoa ei olisi pitänyt nimiöidä tällä tyypillä. <p> Jos tämä on mielestäsi vika, lähetä vikailmoitus tätä pakettia vastaan.

source: If you want to fix the label. $TARGET_PATH default label should be %s.
fi: Jos haluat korjata nimiön. Oletusnimiön $TARGET_PATH tulee olla %s.

source: you can run restorecon. The access attempt may have been stopped due to insufficient permissions to access a parent directory in which case try to change the following command accordingly.
fi: voit suorittaa restorecon:in. Pääsyyritys on saatettu keskeyttää, koska isäntähakemistojen käyttöoikeudet eivät ole riittävät, tässä tapauksessa yritä muuttaa seuraava komento vastaavasti.

source: Restore Context
fi: Palauta Konteksti

source: You can restore the default system context to this file by executing the restorecon command. restorecon '$SOURCE_PATH'.
fi: Voit palauttaa järjestelmän oletuskontekstin tähän tiedostoon suorittamalla restorecon-komennon: restorecon '$SOURCE_PATH'.

source: SELinux denied access requested by $SOURCE. $SOURCE_PATH may be mislabeled. $SOURCE_PATH default SELinux type is <B>%s</B>, but its current type is <B>$SOURCE_TYPE</B>. Changing this file back to the default type may fix your problem. <p> This file could have been mislabeled either by user error, or if an normally confined application was run under the wrong domain. <p> However, this might also indicate a bug in SELinux because the file should not have been labeled with this type. <p> If you believe this is a bug, please file a bug report against this package.
fi: SELinux eväsi $SOURCE: n pyytämän pääsyn. $SOURCE_PATH saattaa olla väärin nimiöity. $SOURCE_PATH SELinux oletustyyppi on <B>%s</B>, mutta sen nykyinen tyyppi on <B>$SOURCE_TYPE</B>. Tämän tiedosto vaihtaminen takaisin oletustyyppiin voi korjata ongelmasi. <p> Tämä tiedosto on voitu nimiöidä väärin joko käyttäjän virheestä tai normaalisti suljetun sovelluksen vuoksi jota suoritettiin väärässä toimialueessa. <p> Tämä saattaa kuitenkin osoittaa myös virheen SELinuxissa, koska tiedostoa ei olisi pitänyt nimiöidä tämän tyyppiseksi. <p> Jos tämä on mielestäsi vika, lähetä vikailmoitus tätä pakettia vastaan.

source: If you want to fix the label. $SOURCE_PATH default label should be %s.
fi: Jos haluat korjata nimiön. Oletusnimiön $SOURCE_PATH tulee olla %s.

source: you can run restorecon.
fi: voit suorittaa: restorecon.

source: SELinux denied RSYNC access to $TARGET_PATH. If this is an RSYNC repository, it has to have a file context label of rsync_data_t. If you did not intend to use $TARGET_PATH as an RSYNC repository, this message could indicate either a bug or an intrusion attempt.
fi: SELinux eväsi RSYNC-pääsyn kohteeseen $TARGET_PATH. Jos tämä on RSYNC-ohjelmistolähde, sillä on oltava tiedoston kontekstinimiö rsync_data_t. Jos et aikonut käyttää $TARGET_PATH RSYNC-ohjelmistolähteenä, voi tämä viesti olla osoitus joko virheestä tai tunkeutumisyrityksestä.

source: You can alter the file context by executing chcon -R -t rsync_data_t '$TARGET_PATH' You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t rsync_data_t '$FIX_TARGET_PATH'"
fi: Voit muuttaa tiedoston kontekstia suorittamalla chcon -R -t rsync_data_t '$TARGET_PATH' Sinun on myös muutettava järjestelmän oletustiedostokontekstit, jotta ne säilyvät myös täydessä uudelleennimiöinnissä. "semanage fcontext -a -t rsync_data_t '$FIX_TARGET_PATH'"

source: If $TARGET_BASE_PATH should be shared via the RSYNC daemon
fi: Jos $TARGET_BASE_PATH pitäisi jakaa RSYNC-demonin kautta

source: You need to change the label on $TARGET_BASE_PATH
fi: Sinun on vaihdettava nimiö kohteelle $TARGET_BASE_PATH

source: SELinux is preventing Samba ($SOURCE_PATH) "$ACCESS" access to $TARGET_PATH.
fi: SELinux estää Samban ($SOURCE_PATH) "$ACCESS" -käyttöoikeuden $TARGET_PATH -palveluun.

source: SELinux denied samba access to $TARGET_PATH. If you want to share this directory with samba it has to have a file context label of samba_share_t. If you did not intend to use $TARGET_PATH as a samba repository, this message could indicate either a bug or an intrusion attempt. Please refer to 'man samba_selinux' for more information on setting up Samba and SELinux.
fi: SELinux eväsi sambalta pääsyn kohteeseen $TARGET_PATH. Jos haluat jakaa tämän hakemiston samban kanssa, sillä on oltava tiedoston kontekstinimiö samba_share_t. Jos et aikonut käyttää $TARGET_PATH samba-ohjelmistolähteenä, voi tämä viesti olla osoitus joko virheestä tai tunkeutumisyrityksestä. Katso lisätietoja Samba- ja SELinux määrittämisestä kohdasta 'man samba_selinux'.

source: You can alter the file context by executing chcon -R -t samba_share_t '$TARGET_PATH' You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t samba_share_t '$FIX_TARGET_PATH'"
fi: Voit muuttaa tiedoston kontekstia suorittamalla chcon -R -t samba_share_t '$TARGET_PATH' Sinun on myös muutettava järjestelmän oletustiedostokontekstit, jotta ne säilyvät myös täydessä uudelleennimiöinnissä. "semanage fcontext -a -t samba_share_t '$FIX_TARGET_PATH'"

source: SELinux has denied $SOURCE from connecting to a network port $PORT_NUMBER within a sandbox. If $SOURCE should be allowed to connect on $PORT_NUMBER, you need to use a different sandbox type like sandbox_web_t or sandbox_net_t. # sandbox -X -t sandbox_net_t $SOURCE If $SOURCE is not supposed to connect to $PORT_NUMBER, this could signal an intrusion attempt.
fi: SELinux on evännyt $SOURCE:n muodostamasta yhteyttä verkkoporttiin $PORT_NUMBER hiekkalaatikossa. Jos $SOURCE:n pitäisi sallia muodostaa yhteys osoitteeseen $PORT_NUMBER, sinun on käytettävä erilaista hiekkalaatikkotyyppiä, kuten sandbox_web_t tai sandbox_net_t. # sandbox -X -t sandbox_net_t $SOURCE Jos $SOURCE:n ei pitäisi yhdistyä porttiin $PORT_NUMBER tämä voi merkitä tunkeutumisyritystä.

source: If you want to allow $SOURCE to connect to $PORT_NUMBER, you can execute # sandbox -X -t sandbox_net_t $SOURCE
fi: Jos haluat antaa $SOURCE:n muodostaa yhteyden porttiin $PORT_NUMBER, voit suorittaa komennon: # sandbox -X -t sandbox_net_t $SOURCE

source: you need to modify the sandbox type. sandbox_web_t or sandbox_net_t. For example: sandbox -X -t sandbox_net_t $SOURCE_PATH Please read 'sandbox' man page for more details.
fi: sinun on muokattava hiekkalaatikkotyyppiä. sandbox_web_t tai sandbox_net_t. Esimerkiksi: sandbox -X -t sandbox_net_t $SOURCE_PATH Lue lisätietoja 'sandbox' man -sivulta.

source: Your system may be seriously compromised!
fi: Järjestelmäsi saattaa olla vakavasti vaarantunut!

source: SELinux has prevented $SOURCE from modifying $TARGET. This denial indicates $SOURCE was trying to modify the selinux policy configuration. All applications that need this access should have already had policy written for them. If a compromised application tries to modify the SELinux policy this AVC will be generated. This is a serious issue. Your system may very well be compromised.
fi: SELinux on estänyt $SOURCE:a muokkaamasta $TARGET:ia. Tämä kieltäminen osoittaa, että $SOURCE yritti muokata selinux-käytäntöasetuksia. Kaikilla sovelluksilla, jotka tarvitsevat tämän käyttöoikeuden, pitäisi jo olla käytäntö kirjoitettu sitä varten. Jos vaarantunut sovellus yrittää muokata SELinuxia, niin tämä AVC luodaan. Tämä on vakava asia. Järjestelmäsi voi hyvinkin olla vaarantunut.

source: If you did not directly cause this AVC through testing.
fi: Jos et aiheuttanut tätä AVC:tä suoraan testauksen avulla.

source: if you think that you might have been hacked
fi: jos luulet, että sinut on voitu hakkeroida
