Repository: codacy-open-source-projects-scans/setroubleshoot-plugins
Catalog: po/*.po
Languages: fi

source: Your system may be seriously compromised! $SOURCE_PATH tried to modify SELinux enforcement.
fi: Järjestelmäsi saattaa olla vakavasti vaarantunut! $SOURCE_PATH yritti muokata SELinux-pakotetta.

source: SELinux has prevented $SOURCE from writing to a file under /sys/fs/selinux. Files under /sys/fs/selinux control the way SELinux is configured. All programs that need to write to files under /sys/fs/selinux should have already had policy written for them. If a compromised application tries to turn off SELinux this AVC will be generated. This is a serious issue. Your system may very well be compromised.
fi: SELinux on estänyt $SOURCE:ta kirjoittamasta tiedostoon /sys/fs/selinux -kansiossa. Tiedostot /sys/fs/selinux -kansiossa hallitsevat tapaa, jolla SELinux määritetään. Kaikilla ohjelmilla, jotka on kirjoitettava tiedostoihin /sys/fs/selinux kansioon, pitäisi jo olla käytäntö kirjoitettu sitä varten. Jos vaarantunut sovellus yrittää sammuttaa SELinuxin, niin tämä AVC luodaan. Tämä on vakava asia. Järjestelmäsi voi hyvin olla vaarantunut.

source: If you believe $SOURCE_PATH tried to disable SELinux.
fi: Jos uskot, että $SOURCE_PATH yritti poistaa SELinuxin käytöstä.

source: you may be under attack by a hacker, since confined applications should never need this access.
fi: olet voinut joutua hakkerin hyökkäyksen kohteeksi, koska rajoitetuttujen sovellusten ei koskaan pitäisi tarvitse tätä käyttöoikeutta.

source: SELinux denied access requested by $SOURCE. $TARGET_PATH may be mislabeled. sshd is allowed to read content in /root/.ssh directory if it is labeled correctly.
fi: SELinux eväsi $SOURCE: n pyytämän pääsyn. $TARGET_PATH saattaa olla väärin merkittyjä. sshd saa lukea sisältöä hakemistosta /root/.ssh, jos se on merkitty oikein.

source: You can restore the default system context to this file by executing the restorecon command. # restorecon -R /root/.ssh
fi: Voit palauttaa järjestelmän oletusympäristön tähän tiedostoon suorittamalla komento 'restorecon'. # restorecon -R /root/.ssh

source: Restore Context
fi: Palauta konteksti

source: SELinux is preventing $SOURCE_PATH "$ACCESS" to $TARGET_PATH.
fi: SELinux estää $SOURCE_PATH "$ACCESS" -käyttöoikeuden $TARGET_PATH:oon.

source: SELinux denied $SOURCE access to $TARGET_PATH. If this is a swapfile, it has to have a file context label of swapfile_t. If you did not intend to use $TARGET_PATH as a swapfile, this message could indicate either a bug or an intrusion attempt.
fi: SELinux eväsi $SOURCE -käyttöoikeuden kohteeseen $TARGET_PATH. Jos tämä on näennäistiedosto, sillä on oltava tiedoston kontekstinimiö swapfile_t. Jos et aikonut käyttää $TARGET_PATH:ia swap-tiedostona, voi tämä viesti osoittaa joko virheen tai tunkeutumisyrityksen.

source: You can alter the file context by executing chcon -t swapfile_t '$TARGET_PATH' You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t swapfile_t '$FIX_TARGET_PATH'"
fi: Voit muuttaa tiedoston kontekstia suorittamalla chcon -t swapfile_t '$TARGET_PATH' Sinun on myös muutettava järjestelmän oletustiedostokontekstit, jotta ne säilyvät myös täydessä uudelleennimiöinnissä. "semanage fcontext -a -t swapfile_t '$FIX_TARGET_PATH'"

source: If you do not believe your $SOURCE_PATH should be modifying the kernel, by loading kernel modules
fi: Jos et usko, että $SOURCE_PATH:n pitäisi muuttaa ydintä, lataamalla ytimen moduulit

source: You might have been hacked.
fi: Sinua on ehkä hakkeroitu.

source: Your system may be seriously compromised! $SOURCE_PATH tried to load a kernel module.
fi: Järjestelmäsi saattaa olla vakavasti vaarantunut! $SOURCE_PATH yritti ladata ytimen moduulia.

source: SELinux has prevented $SOURCE from loading a kernel module. All confined programs that need to load kernel modules should have already had policy written for them. If a compromised application tries to modify the kernel this AVC will be generated. This is a serious issue. Your system may very well be compromised.
fi: SELinux on estänyt $SOURCE:a lataamasta ytimen moduulia. Kaikilla suljetuilla ohjelmilla, joiden tarvitsee ladata ytimen moduuleja, pitäisi jo olla käytäntö kirjoitettu sitä varten. Jos vaarantunut sovellus yrittää muokata ydintä, niin tämä AVC luodaan. Tämä on vakava ongelma. Järjestelmäsi voi hyvinkin olla vaarantunut.

source: If you do not believe that $SOURCE_PATH should be attempting to modify the kernel by loading a kernel module.
fi: Jos et usko, että $SOURCE_PATH:n pitäisi yrittää muokata ydintä lataamalla ytimen moduuli.

source: A process might be attempting to hack into your system.
fi: Prosessi saattaa yrittää hakkeroida järjestelmääsi.

source: SELinux is preventing $SOURCE_PATH the "sys_resource" capability.
fi: SELinux estää $SOURCE_PATH "sys_resource" -kyvyn.

source: Confined domains should not require "sys_resource". This usually means that your system is running out some system resource like disk space, memory, quota etc. Please clear up the disk and this AVC message should go away. If this AVC continues after you clear up the disk space, please report this as a bug.
fi: Rajoitettujen toimialueiden ei pitäisi pyytää "sys_resource". Tämä tarkoittaa yleensä, että järjestelmässäsi on loppumassa jokin järjestelmäresurssi, kuten levytila, muisti, kiintiö jne. Ole hyvä ja tyhjennä levy ja tämän AVC-viestin pitäisi poistua. Jos tämä AVC jatkuu levytilan tyhjentämisen jälkeen, ilmoita siitä virheenä.

source: If you do not want processes to require capabilities to use up all the system resources on your system;
fi: Jos et halua prosessien vaativan valmiuksia käyttää kaikkia järjestelmän järjestelmäresursseja;

source: you need to diagnose why your system is running out of system resources and fix the problem. According to /usr/include/linux/capability.h, sys_resource is required to: /* Override resource limits. Set resource limits. */ /* Override quota limits. */ /* Override reserved space on ext2 filesystem */ /* Modify data journaling mode on ext3 filesystem (uses journaling resources) */ /* NOTE: ext2 honors fsuid when checking for resource overrides, so you can override using fsuid too */ /* Override size restrictions on IPC message queues */ /* Allow more than 64hz interrupts from the real-time clock */ /* Override max number of consoles on console allocation */ /* Override max number of keymaps */
fi: sinun on diagnosoitava, miksi järjestelmässäsi resurssit loppuvat, ja korjattava ongelma. Sivuston /usr/include/linux/capability.h mukaan sys_resource vaaditaan halutessa: / * Ohita resurssirajat. Aseta resurssirajat. * / / * Ohita kiintiörajat. * / / * Ohita varattu tila ext2-tiedostojärjestelmässä * / / * Muokkaa datan kirjaustilaa ext3-tiedostojärjestelmässä (käyttää kirjausta resurssit) * / / * HUOMAUTUS: ext2 kunnioittaa fsuidia tarkistaessaan resurssien ohituksia, joten voit ohittaa myös fsuid * / / * Ohita IPC-viestijonojen kokorajoitukset * / / * Salli yli 64 Hz:n keskeytykset reaaliaikakellosta * / / * Ohita konsolien enimmäismäärä konsoleissa * / / * Ohita näppäinkarttojen enimmäismäärä * /

source: SELinux has prevented vbetool from performing an unsafe memory operation.
fi: SELinux on estänyt vbetoolia suorittamasta vaarallista muistitoimintoa.

source: SELinux denied an operation requested by $SOURCE, a program used to alter video hardware state. This program is known to use an unsafe operation on system memory but so are a number of malware/exploit programs which masquerade as vbetool. This tool is used to reset video state when a machine resumes from a suspend. If your machine is not resuming properly your only choice is to allow this operation and reduce your system security against such malware.
fi: SELinux eväsi $SOURCE:n pyytämän toiminnon muuttaa videolaitteiston tilaa. Tämän ohjelman tiedetään käyttävän vaarallista toimintaa järjestelmän muistissa, mutta niin haluavat myös monet haittaohjelmat/hyväksikäyttöohjelmat vbetooliksi naamioituina. Tätä työkalua käytetään nollaamaan videotila, kun kone palautuu keskeytyksestä. Jos koneesi ei palaudu kunnolla, ainoa valinta on sallia tämä toiminto ja vähentää järjestelmän turvallisuutta tällaisia haittaohjelmia vastaan.

source: If you decide to continue to run the program in question you will need to allow this operation. This can be done on the command line by executing: # setsebool -P mmap_low_allowed 1
fi: Jos päätät jatkaa kyseisen ohjelman suorittamista sinun pitää sallia tämä toiminto. Tämä voidaan tehdä komentoriviltä suorittamalla: # setsebool -P mmap_low_allowed 1

source: If you want to ignore this AVC because it is dangerous and your machine seems to be working correctly.
fi: Jos haluat jättää tämän AVC: n huomiotta, koska se on vaarallinen ja koneesi näyttää toimivan oikein.

source: you must tell SELinux about this by enabling the vbetool_mmap_zero_ignore boolean.
fi: sinun on kerrottava tästä SELinuxille ottamalla käyttöön vbetool_mmap_zero_ignore totuusarvo.

source: Turn off memory protection
fi: Poista muistisuojaus käytöstä

source: SELinux has prevented wine from performing an unsafe memory operation.
fi: SELinux on estänyt wine:a suorittamasta vaarallisia muistitoimintoja.

source: SELinux denied an operation requested by wine-preloader, a program used to run Windows applications under Linux. This program is known to use an unsafe operation on system memory but so are a number of malware/exploit programs which masquerade as wine. If you were attempting to run a Windows program your only choices are to allow this operation and reduce your system security against such malware or to refrain from running Windows applications under Linux. If you were not attempting to run a Windows application this indicates you are likely being attacked by some for of malware or program trying to exploit your system for nefarious purposes. Please refer to http://wiki.winehq.org/PreloaderPageZeroProblem Which outlines the other problems wine encounters due to its unsafe use of memory and solutions to those problems.
fi: SELinux eväsi ohjelman Wine-preloader pyytämän toiminnon, ohjelman avulla suoritetaan Windows-sovelluksia Linuxissa. Tämän ohjelman tiedetään käyttävän vaarallista toimintaa järjestelmän muistissa, mutta niin käyttävät myös monet haittaohjelmat/hyödytämisohjelmat wineksi naamioituneena. Jos yritit suorittaa Windows-ohjelmaa, ainoat vaihtoehtosi on sallia tämä ja vähentää järjestelmän suojausta tällaisilta haittaohjelmilta tai pidättäydy Windows-sovellusten ajamisesta Linuxissa. Jos et yrittänyt suorittaa Windows-sovellusta, tarkoittaa se todennäköisesti sitä, että jotkut hyökkäävät haittaohjelmia tai hyväksikäyttöohjelmia käyttäen, yrittäen käyttää sinun järjestelmääsi turhiin tarkoituksiin. Ole hyvä ja katso http://wiki.winehq.org/PreloaderPageZeroProblem Mikä hahmottaa muut wine ongelmat sen epäturvallisen muistin käytön vuoksi ja ratkaisuja näihin ongelmiin.

source: If you want to ignore this AVC because it is dangerous and your wine applications are working correctly.
fi: Jos haluat jättää tämän AVC: n huomiotta, koska se on vaarallista ja wine-sovelluksesi toimivat oikein.

source: you must tell SELinux about this by enabling the wine_mmap_zero_ignore boolean.
fi: sinun on kerrottava tästä SELinuxille ottamalla käyttöön wine_mmap_zero_ignore totuusarvo.

source: SELinux is preventing xen ($SOURCE_PATH) "$ACCESS" access to $TARGET_PATH.
fi: SELinux estää xen ($SOURCE_PATH) "$ACCESS" -pääsyn $TARGET_PATH:iin.

source: SELinux denied xen access to $TARGET_PATH. If this is a XEN image, it has to have a file context label of xen_image_t. The system is setup to label image files in directory /var/lib/xen/images correctly. We recommend that you copy your image file to /var/lib/xen/images. If you really want to have your xen image files in the current directory, you can relabel $TARGET_PATH to be xen_image_t using chcon. You also need to execute semanage fcontext -a -t xen_image_t '$FIX_TARGET_PATH' to add this new path to the system defaults. If you did not intend to use $TARGET_PATH as a xen image it could indicate either a bug or an intrusion attempt.
fi: SELinux eväsi xen:iltä käyttöoikeuden kohteeseen $TARGET_PATH. Jos tämä on XEN-levykuva, sillä on oltava tiedoston kontekstinimiö xen_image_t. Järjestelmä on asetettu nimiöimään levykuvatiedostot hakemistossa /var/lib/xen/images oikein. Suosittelemme, että kopioit levykuvatiedostosi hakemistoon /var/lib/xen/images. Jos haluat todella, että xen-levykuvatiedostosi ovat nykyisessä hakemistossa, voit nimiöidä $TARGET_PATH uudelleen xen_image_t:ksi chcon:illa. Sinun on myös suoritettava semanage fcontext -a -t xen_image_t '$FIX_TARGET_PATH' lisätäksesi tämän uuden polun järjestelmän oletuksiin. Jos et aikonut käyttää $TARGET_PATH xen levykuvana, voi se osoittaa joko virheen tai tunkeutumisyrityksen.

source: You can alter the file context by executing chcon -t xen_image_t '$TARGET_PATH' You must also change the default file context files on the system in order to preserve them even on a full relabel. "semanage fcontext -a -t xen_image_t '$FIX_TARGET_PATH'"
fi: Voit muuttaa tiedoston kontekstia suorittamalla chcon -t xen_image_t '$TARGET_PATH' Sinun on myös muutettava järjestelmän oletustiedostokontekstit, jotta ne säilyvät myös täydessä uudelleennimiöinnissä. "semanage fcontext -a -t xen_image_t '$FIX_TARGET_PATH'"

source: Change the file label to xen_image_t.
fi: Vaihda tiedostotunnisteeksi xen_image_t.
